### Аналитический отчёт для HR-отдела


<br><br> В базе данных лежит набор таблиц, которые содержат данные о сотрудниках вымышленной компании.
Сделаем обзор штата сотрудников компании. Составим набор предметов исследования, а затем проверим их на данных. Вся аналитика будет выполена с помощью SQL.
<br><br>
Параметры для подключения следующие: хост – `dsstudents.skillbox.ru`, порт – `5432`, имя базы данных – `human_resources`, пользователь – `readonly`, пароль – `6hajV34RTQfmxhS`. Таблицы, доступные для анализа, – `hr_dataset`, `production_staff`, `recruiting_costs`, `salary_grid`.

Для начала импортируем pandas и подключимся к базе данных.

In [ ]:
import pandas as pd

In [ ]:
from sqlalchemy import create_engine
con = create_engine('postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/human_resources')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

Чтобы не прописывать каждый раз команду pd.read_sql(sql, con), учитывая, что подключение у нас одно и то же, напишем функцию select, которая будет принимать запрос "sql" и оборачивать его в команду read_sql.

In [ ]:
def select(sql):
  return pd.read_sql(sql, con)

# Анализ базы данных сотрудников

Таблица hr_dataset содержит данные обо всех работниках, а таблица production_staff содержит дополнительные данные по производственному персоналу, как правило это люди, работающие на производственной линии.
Предметами нашего исследования будут показатели  Days Employed (количество отработанных дней) и Performance Score (будем называть производительностью) для всех сотрудников, а также Daily Error Rate (ежедневная частота ошибок)	90-day Complaints (жалобы на работника) для сотрудников, указанных в таблице production staff.
Рассмотрим, от чего зависят эти показатели.

In [ ]:
sql = 'select * from hr_dataset'
select(sql)

      id  ...         Performance Score
0      1  ...               Fully Meets
1      2  ...               Fully Meets
2      3  ...               Fully Meets
3      4  ...  N/A- too early to review
4      5  ...  N/A- too early to review
..   ...  ...                       ...
305  306  ...               Fully Meets
306  307  ...               Fully Meets
307  308  ...               Fully Meets
308  309  ...               Fully Meets
309  310  ...               Fully Meets

[310 rows x 29 columns]

Посчитаем сколько всего уникальных работников

In [ ]:
sql = '''select distinct hd."Employee Name" from hr_dataset as hd'''
select(sql)

           Employee Name
0        Martins, Joseph
1         Ngodup, Shari
2          Horton, Jayne
3           Stoica, Rick
4       Jacobi, Hannah
..                   ...
305     Chivukula, Enola
306  Kirill, Alexandra
307       Lunquist, Lisa
308         Gilles, Alex
309   Squatrito, Kristen

[310 rows x 1 columns]

Можем заключить, что строки не содержат данных об одних и тех же людях, просто работающих на разных вакансиях, а содержат текущие, актуальные записи о сотрудниках

Сначала определим какие категории встречаются в оценке производительности сотрудников (Performance Score).

In [ ]:
sql = '''select distinct hd."Performance Score", hd.perf_scoreid from hr_dataset as hd'''
select(sql)

          Performance Score  perf_scoreid
0                   Exceeds             4
1  N/A- too early to review             9
2               Fully Meets             3
3                       PIP             1
4               Exceptional             5
5              90-day meets             0
6         Needs Improvement             2

Посмотрев вместе на категории оценки производительности и их id можно попробовать предположить значения этих категорий. Exceptional - это исключительный, самая высокая оценка в перечне, Exceeds - можно перевести как "превышает", это следующая по уровню оценка, затем мы можем поставить Fully Meets - полное соответствие и Needs Improvement - требует улучшения. Мы видим, что id performance score соответствуют степени оценки и также идут, уменьшаясь от 5 до 2. Отсюда можно предположить, что PIP - это самая низшая оценка, полное несоответствие, так и будем её интерпретировать.
90-day meets имеет id 0, и может быть переведено как 90-дневный срок, что походит на испытательный срок, возможно назначенный после служебного несоответствия, будем считать эту оценку самой низкой, в соответствии с её id.
А оценка N/A- too early to review не является оценкой, т.к. означает, что ещё недостаточно времени для оценивания данного сотрудника.

### Производительность сотрудников по департаментам

In [ ]:
sql = '''select hd.department,
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd.department'''
select(sql)

             department  count_  performance_score_avg
0     Production            183               2.737705
1         Admin Offices       8               2.625000
2                 IT/IS      41               2.634146
3      Executive Office       1               3.000000
4  Software Engineering      10               2.600000
5                 Sales      30               2.666667

Распределение сотрудников по департаментам очень неравномерно, кроме того, оценки труда близки к 2,6 у всех департаментов, то есть стремятся к полному соответствию, хотя видна необходимость улучшений.

In [ ]:
sql = '''select hd.department,
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd

group by hd.department'''
select(sql)

             department  count_  days_employed_avg
0     Production            208        1308.024038
1         Admin Offices      10        1420.700000
2                 IT/IS      50         981.800000
3      Executive Office       1        1973.000000
4  Software Engineering      10        1417.800000
5                 Sales      31        1621.548387

Средний срок работы в каждом департаменте отличается, однако, практически везде заметно превышает 1000 дней, что является хорошим показателем. Из общей картины выбивается только IT/IS департамент, но это может быть связано с самой отраслью.

Можем сделать вывод, что в компании нету однозначно проблемных департаментов, однако имеет смысл обратить внимание на средний срок работы сотрудников IT департамента - если он начнет сокращаться - это может стать проблемой.

##Анализ показателей сотрудников, работающих под руководством разных менеджеров.

In [ ]:
sql = '''select hd."Manager Name",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."Manager Name"
order by "performance_score_avg" desc'''
select(sql)

          Manager Name  count_  performance_score_avg
0      Jennifer Zamora       7               3.285714
1         Eric Dougall       4               3.250000
2           Janet King      19               3.157895
3   Board of Directors       2               3.000000
4     Brian Champaigne       8               3.000000
5             Amy Dunn      16               2.937500
6        David Stanley      17               2.882353
7       Brannon Miller      21               2.857143
8        Lynn Daneault      12               2.750000
9        Ketsia Liebig      19               2.736842
10       Kelley Spirea      21               2.714286
11      Debra Houlihan       3               2.666667
12      Michael Albert      16               2.625000
13        Elijiah Gray      19               2.578947
14          John Smith      14               2.571429
15      Kissy Sullivan      21               2.571429
16     Alex Sweetwater       9               2.555556
17      Webster Butler      18               2.500000
18  Brandon R. LeBlanc       5               2.400000
19          Simon Roup      13               2.153846
20        Peter Monroe       9               2.000000

Среди менеджеров распределение сотрудников более равномерное, и мы видим, что средняя оценка производительности сильно варьируется в зависимости от личности менеджера. Можем предположить, что оценка производительности (perfomance score) зависит от того, под чьим руководством работает сотрудник.

In [ ]:
sql = '''select hd."Manager Name",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd

group by hd."Manager Name" order by "days_employed_avg" desc'''
select(sql)

          Manager Name  count_  days_employed_avg
0   Board of Directors       2        2610.000000
1         Eric Dougall       4        2384.000000
2        Lynn Daneault      13        1776.769231
3      Jennifer Zamora       7        1693.714286
4           Janet King      19        1620.421053
5           John Smith      14        1598.642857
6       Brannon Miller      21        1591.761905
7        Ketsia Liebig      21        1489.952381
8        Kelley Spirea      22        1387.272727
9         Elijiah Gray      22        1374.181818
10       David Stanley      21        1369.809524
11     Alex Sweetwater       9        1320.333333
12  Brandon R. LeBlanc       7        1233.285714
13      Debra Houlihan       3        1162.666667
14      Webster Butler      21        1125.190476
15      Michael Albert      22        1098.318182
16            Amy Dunn      21        1077.952381
17      Kissy Sullivan      22        1046.954545
18        Peter Monroe      14         942.857143
19          Simon Roup      17         679.176471
20    Brian Champaigne       8         307.500000

В зависимости от того, под чьим руководством работает сотрудник, время его работы может очень сильно отличаться. Сотрудники отдельных менеджеров работают (в среднем) более 5-ти лет, в то время как сотрудники некоторых других уходят, не проработав и 3-х лет.

Отделу кадров можно рекомендовать обратить особое внимание на тех, под чьим руководством работает сотрудник, так как подчиненные некоторых менеджеров имеют и низкую производительность и короткое время работы, в то время как подчиненные других показывают высокие результаты в обоих показателях.

### Анализ показателей женатых и неженатых сотрудников.

Зависимость производительности от того, находится сотрудник в браке или нет достаточно невелика - мы видим отклонение в 0,23 пункта. И хотя группы всего две, размера выборки недостаточно, чтобы подобное отклонение стало существенным.

In [ ]:
sql = '''select hd."marriedid",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."marriedid" '''
select(sql)

   marriedid  count_  performance_score_avg
0          0     164               2.798780
1          1     109               2.568807

In [ ]:
sql = '''select hd."marriedid",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd
group by hd."marriedid" '''
select(sql)

   marriedid  count_  days_employed_avg
0          0     187        1328.866310
1          1     123        1246.235772

Неженатые сотрудники работают, в среднем, чуть дольше, но эта разница также недостаточно значительна, чтобы на ее основе предлогать какие-либо рекомендации.

##Зависимость показателей сотрудников от их семейного статуса

In [ ]:
sql = '''select distinct hd."maritaldesc", hd.maritalstatusid from hr_dataset as hd'''
select(sql)

  maritaldesc  maritalstatusid
0     Married                1
1      Single                0
2     Widowed                4
3    Divorced                2
4   Separated                3

Всего сотрудники разделены на 5 групп: одинокие, женатые, овдовевшие, разведенные и те, кто живет раздельно.

In [ ]:
sql = '''select hd."maritaldesc",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."maritaldesc" '''
select(sql)

  maritaldesc  count_  performance_score_avg
0     Widowed       4               3.500000
1     Married     109               2.568807
2   Separated      11               3.000000
3      Single     123               2.756098
4    Divorced      26               2.807692

Данные показывают, что женатые люди работают несколько хуже чем те, чья личная жизнь еще не успела сложиться.

In [ ]:
sql = '''select hd."maritaldesc",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."maritaldesc" '''
select(sql)

  maritaldesc  count_  days_employed_avg
0     Widowed       4        1085.750000
1     Married     109        1345.110092
2   Separated      11        1776.000000
3      Single     123        1446.130081
4    Divorced      26        1268.307692

Есть небольшая зависимость между временем работы в компании и семейным положением сотрудника.

### Исследование зависимости производительности и времени работы в компании от возраста сотрудника.

In [ ]:
sql = '''select
case when hd."age" < 30 then '20_30'
when hd."age" < 40 then '30_40'
when hd."age" < 50 then '40_50'
when hd."age" >= 50 then '50+'
end as age_bin,

count(1),
avg(hd.perf_scoreid) as performance_score_avg


from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'

group by (case when hd."age" < 30 then '20_30'
when hd."age" < 40 then '30_40'
when hd."age" < 50 then '40_50'
when hd."age" >= 50 then '50+'
end)

'''
select(sql)

  age_bin  count  performance_score_avg
0   40_50     76               2.789474
1   20_30     29               2.758621
2     50+     36               2.805556
3   30_40    132               2.621212

Разбив работников на группы по возрастам, мы видим, что возраст не сильно коррелирует с оценкой производительности, ниже всего она в группе 30-40 лет, но отличия не столь велики.

In [ ]:
sql = '''select
case when hd."age" < 30 then '20_30'
when hd."age" < 40 then '30_40'
when hd."age" < 50 then '40_50'
when hd."age" >= 50 then '50+'
end as age_bin,

count(1),
avg(hd."Days Employed") as days_employed_avg


from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'

group by (case when hd."age" < 30 then '20_30'
when hd."age" < 40 then '30_40'
when hd."age" < 50 then '40_50'
when hd."age" >= 50 then '50+'
end)

'''
select(sql)

  age_bin  count  days_employed_avg
0   40_50     76        1436.526316
1   20_30     29        1557.000000
2     50+     36        1344.250000
3   30_40    132        1353.212121

Аналогичные выводы мы можем сделать относительно продолжительности работы сотрудника в компании. В целом, производительность работы и продолжительность работы в компании не зависят от возраста сотрудника.

### Зависимость производительности труда и времени работы в компании от ставки оплаты сотрудника

In [ ]:
sql = '''select
case when hd."Pay Rate" < 20 then '0_20'
when hd."Pay Rate" < 25 then '20_25'
when hd."Pay Rate" < 40 then '25_40'
when hd."Pay Rate" >= 40 then '40+'

end as pay_bin,

count(1),
avg(hd.perf_scoreid) as performance_score_avg


from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'

group by pay_bin

'''
select(sql)

  pay_bin  count  performance_score_avg
0   25_40     49               2.571429
1     40+     83               2.734940
2    0_20     61               2.819672
3   20_25     80               2.675000

Посмотрев зависимость результативности от оплаты труда, мы видим что наиболее высокие результаты имеют, как ни странно, те кто получают до 20 (вероятно, долларов), дальше по мере роста зарплаты результативность начинает снижаться, пока не достигает 40, после этого она становится чуть выше.

In [ ]:
sql = '''select
case when hd."Pay Rate" < 20 then '0_20'
when hd."Pay Rate" < 25 then '20_25'
when hd."Pay Rate" < 40 then '25_40'
when hd."Pay Rate" >= 40 then '40+'

end as pay_bin,

count(1),
avg(hd."Days Employed") as days_employed_avg

from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'

group by pay_bin

'''
select(sql)

  pay_bin  count  days_employed_avg
0   25_40     49        1393.510204
1     40+     83        1350.265060
2    0_20     61        1435.573770
3   20_25     80        1417.775000

Время работы сотрудника в компании не связано со ставкой оплаты труда.
Можно рекомендовать руководству задуматься о возможности корректировки ставки оплаты в зависимости от производительности сотрудника.

### Зависимость продуктивности и времени работы в компании сотрудников, в зависимости от их пола.

In [ ]:
sql = '''select hd."sex",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."sex" '''
select(sql)

      sex  count_  performance_score_avg
0  Female     151               2.695364
1    Male     122               2.721311

Видим, что производительность труда не зависит от пола сотрудника.

In [ ]:
sql = '''select hd."sex",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."sex" '''
select(sql)

      sex  count_  days_employed_avg
0  Female     151        1459.476821
1    Male     122        1319.385246

Между временем работы в компании и полом есть незначительная зависимость - в среднем женщины работают чуть дольше, но эта разница достаточно невелика.

### Зависимость производительности и продолжительности работы от расы сотрудников.

In [ ]:
sql = '''select hd."racedesc",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."racedesc" '''
select(sql)

                           racedesc  count_  performance_score_avg
0  American Indian or Alaska Native       4               3.500000
1                          Hispanic       3               2.666667
2                 Two or more races      16               2.812500
3                             Asian      30               2.666667
4                             White     167               2.652695
5         Black or African American      53               2.811321

Представителей American Indian or Alaska Native	слишком мало чтобы делать выводы, однако они единственные, кто показывает существенно лучшие результаты чем другие. Различия между остальными настолько невелики, что мы можем говорить о том, что между производительностью работы и расой сотрудника нет зависимости.

In [ ]:
sql = '''select hd."racedesc",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."racedesc" '''
select(sql)

                           racedesc  count_  days_employed_avg
0  American Indian or Alaska Native       4        1845.000000
1                          Hispanic       3        2062.333333
2                 Two or more races      16        1797.250000
3                             Asian      30        1266.833333
4                             White     167        1324.359281
5         Black or African American      53        1506.603774

Аналогичные результаты мы видим и в отношении времени работы в компании - чем крупнее выборка, тем ближе к среднему будет её результат.

Это позволяет сделать вывод о том, что исследуемые показатели не зависят от расы работника.

### Зависимость производительности работника от времени его работы в компании.

In [ ]:
sql = '''select
case when hd."Days Employed" < 350 then '0_350'
when hd."Days Employed" < 720 then '351_720'
when hd."Days Employed" < 1500 then '721_1500'
when hd."Days Employed" >= 1500 then '1500+'

end as days_bin,

count(1),
avg(hd.perf_scoreid) as performance_score_avg


from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'

group by days_bin

'''
select(sql)

   days_bin  count  performance_score_avg
0     1500+    111               2.954955
1     0_350     24               2.291667
2   351_720     29               2.620690
3  721_1500    109               2.568807

Результативность работы растет со временем, хотя это и нелинейный рост.

### Зависимость производительности от статуса работника.

In [ ]:
sql = '''select hd."Employment Status",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."Employment Status" '''
select(sql)

        Employment Status  count_  performance_score_avg
0            Future Start       2               4.000000
1  Voluntarily Terminated      77               2.493506
2                  Active     168               2.827381
3    Terminated for Cause      12               2.333333
4        Leave of Absence      14               2.571429

Видим, что низкая производительность коррелирует с увольнением работника, что свидетельствует о грамотном взаимодействии с уже имеющимися сотрудниками компании.

### Зависимость предметов исследования от должности сотрудника.

In [ ]:
sql = '''select hd."position",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."position" '''
select(sql)

                        position  count_  performance_score_avg
0                     IT Support       4               3.250000
1         Database Administrator      10               2.200000
2   Software Engineering Manager       1               3.000000
3             Production Manager      14               3.000000
4            Senior BI Developer       3               3.000000
5        Shared Services Manager       2               3.000000
6                   BI Developer       4               3.000000
7                            CIO       1               5.000000
8                  Sales Manager       3               2.666667
9                        Sr. DBA       3               2.000000
10              Network Engineer       6               2.000000
11            Area Sales Manager      26               2.653846
12      Administrative Assistant       1               3.000000
13                Data Architect       1               3.000000
14               IT Manager - DB       2               3.000000
15            IT Manager - Infra       1               2.000000
16                   IT Director       1               5.000000
17       Production Technician I     119               2.689076
18                   BI Director       1               3.000000
19             Software Engineer       9               2.555556
20          Sr. Network Engineer       3               2.000000
21             Director of Sales       1               3.000000
22               President & CEO       1               3.000000
23                Sr. Accountant       2               1.500000
24      Production Technician II      49               2.755102
25          IT Manager - Support       1               4.000000
26        Director of Operations       1               4.000000
27                  Accountant I       3               3.000000

Получить полезную информацию из агрегирования работников по должностям не представляется возможным, так как распределение получается слишком неравномерным - на многих должностях работает менее 5-ти человек.

In [ ]:
sql = '''select hd."position",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd
group by hd."position" '''
select(sql)

                        position  count_  days_employed_avg
0                     IT Support       4        2384.000000
1         Database Administrator      13         734.384615
2   Software Engineering Manager       1        2295.000000
3             Production Manager      14        1509.000000
4            Senior BI Developer       3         331.000000
5        Shared Services Manager       2        1163.500000
6                   BI Developer       4         286.000000
7                            CIO       1        2787.000000
8                  Sales Manager       3        1162.666667
9                        Sr. DBA       4         499.750000
10              Network Engineer       9         930.888889
11            Area Sales Manager      27        1684.407407
12      Administrative Assistant       3         576.000000
13                Data Architect       1         323.000000
14               IT Manager - DB       2        1583.000000
15            IT Manager - Infra       1        2111.000000
16                   IT Director       1        2417.000000
17       Production Technician I     136        1359.750000
18                   BI Director       1         446.000000
19             Software Engineer       9        1320.333333
20          Sr. Network Engineer       5         964.400000
21             Director of Sales       1        1301.000000
22               President & CEO       1        1973.000000
23                Sr. Accountant       2        2130.500000
24      Production Technician II      57        1101.228070
25          IT Manager - Support       1        1421.000000
26        Director of Operations       1        3247.000000
27                  Accountant I       3        1963.666667

Аналогичная ситуация и с временем работы сотрудников.

### Зависимость предметов исследования от источника привлечения работника.

In [ ]:
sql = '''select hd."Employee Source",
count(1) as count_,
avg(hd.perf_scoreid) as performance_score_avg
from hr_dataset as hd
where "Performance Score" != 'N/A- too early to review'
group by hd."Employee Source"
order by performance_score_avg'''
select(sql)

                           Employee Source  count_  performance_score_avg
0                       Newspager/Magazine      14               2.142857
1                       Website Banner Ads      11               2.181818
2   Social Networks - Facebook Twitter etc      10               2.200000
3                            Word of Mouth      11               2.363636
4                                    Other       8               2.375000
5                          Vendor Referral      11               2.454545
6                                Glassdoor      13               2.538462
7        Search Engine - Google Bing Yahoo      24               2.666667
8                              Monster.com      22               2.681818
9                   Pay Per Click - Google      19               2.684211
10                       Employee Referral      26               2.730769
11                         Internet Search       5               2.800000
12                               Billboard      15               2.800000
13                      Diversity Job Fair      26               2.846154
14                           Careerbuilder       1               3.000000
15                 On-line Web application       1               3.000000
16              Company Intranet - Partner       1               3.000000
17                                  Indeed       8               3.000000
18                    On-campus Recruiting      10               3.100000
19                                MBTA ads      17               3.176471
20                    Professional Society      17               3.235294
21                     Information Session       3               3.333333

Мы видим, что есть зависимость между производительностью сотрудника и источником его привлечения. Сотрудники, привлеченные благодаря таким ресурсам как газеты или журналы, баннеры на сайтах, социальных сетей, сарафанного радио, не классифицируемых источников, реферальных программ, сайта Glassdoor, поисковых систем, сайта Monster.com и оплаты за клик показывают худшие результаты. В то время как персонал, который был рекрутирован в университетах и профессиональных сообществах, показывает полное соответствие предъявляемым требованиям.

In [ ]:
sql = '''select hd."Employee Source",
count(1) as count_,
avg(hd."Days Employed") as days_employed_avg
from hr_dataset as hd
group by hd."Employee Source"
order by days_employed_avg'''
select(sql)

                           Employee Source  count_  days_employed_avg
0                            Pay Per Click       1           2.000000
1                  On-line Web application       1         194.000000
2                                   Indeed       8         307.500000
3               Company Intranet - Partner       1         444.000000
4                          Vendor Referral      15        1022.066667
5                            Word of Mouth      13        1022.923077
6   Social Networks - Facebook Twitter etc      11        1082.727273
7                                Glassdoor      14        1134.785714
8                       Newspager/Magazine      18        1193.777778
9                     On-campus Recruiting      12        1214.416667
10                       Employee Referral      31        1252.161290
11                         Internet Search       6        1274.166667
12                  Pay Per Click - Google      21        1287.285714
13       Search Engine - Google Bing Yahoo      25        1324.560000
14                      Diversity Job Fair      29        1340.448276
15                             Monster.com      24        1403.000000
16                    Professional Society      20        1416.600000
17                      Website Banner Ads      13        1471.307692
18                     Information Session       4        1551.500000
19                                MBTA ads      17        1580.352941
20                               Billboard      16        1680.750000
21                                   Other       9        1910.333333
22                           Careerbuilder       1        2428.000000

Похожая ситуация и с временем работы сотрудников в компании. Люди, пришедшие в компанию по объявлениям на сайтах, газетах, с помощью реферальных программ, сотсетей, сайта Glassdoor работают в целом меньше, чем те, кто был привлечен через институты, хотя объявления на рекламных щитах привлекают людей, которые готовы работать продолжительное время.

### Анализ производственного персонала

Производственный персонал имеет дополнительные данные, собранные в одноименной таблице, особый интерес для нас представляет частота ошибок и количество жалоб на работников. Соединим эту таблицу с основной и проанализируем зависимость этих показателей от различных характеристик работника.

In [ ]:
sql = 'select * from production_staff'
select(sql)

      id       Employee Name  ... Daily Error Rate 90-day Complaints
0      1   Albert, Michael    ...              0.0               0.0
1      2      Bozzi, Charles  ...              0.0               0.0
2      3  Butler, Webster  L  ...              0.0               0.0
3      4         Dunn, Amy    ...              0.0               0.0
4      5     Gray, Elijiah    ...              0.0               0.0
..   ...                 ...  ...              ...               ...
251  252                None  ...              NaN               NaN
252  253                None  ...              NaN               NaN
253  254                None  ...              NaN               NaN
254  255                None  ...              NaN               NaN
255  256                None  ...              NaN               NaN

[256 rows x 16 columns]

In [ ]:
sql = '''select "Position", count(1) from production_staff group by "Position"
'''
select(sql)

                   Position  count
0   Production Technician I    137
1                      None     47
2        Production Manager     14
3  Production Technician II     58

Посчитаем, сколько всего работников в таблице product stuff

In [ ]:
sql = '''select distinct "Employee Name" from production_staff'''
select(sql)

                 Employee Name
0               Faller, Megan
1             Anderson, Carol
2              Nowlan, Kristie
3                Walker, Roger
4                Owad, Clinton
..                         ...
205         Hendrickson, Trina
206        Handschiegl, Joanne
207  Cierpiszewski, Caroline
208                Pitt, Brad
209             Liebig, Ketsia

[210 rows x 1 columns]

In [ ]:
sql = '''select * from
production_staff as ps
join hr_dataset on ps."Employee Name" = hr_dataset."Employee Name"

'''
select(sql)

      id  ... Performance Score
0     82  ...       Fully Meets
1      1  ...       Fully Meets
2      2  ...       Fully Meets
3      3  ...           Exceeds
4      4  ...       Fully Meets
..   ...  ...               ...
203  206  ...       Fully Meets
204  207  ...           Exceeds
205  208  ...       Fully Meets
206  209  ...       Fully Meets
207  202  ...       Fully Meets

[208 rows x 45 columns]

Таблица production_staff содержит сведения о производственном персонале, эти работники входят в общую базу данных первой таблицы. Посмотрим ключевые показатели.

### Зависимость предметов исследования от того, под чьим руководством работает сотрудник.

In [ ]:
sql = '''select ps."Manager Name", count(1), avg("Daily Error Rate") as avg_error,
avg("90-day Complaints") as avg_complaints
 from
production_staff as ps
join hr_dataset on ps."Employee Name" = hr_dataset."Employee Name"
group by ps."Manager Name"

'''
select(sql)

     Manager Name  count  avg_error  avg_complaints
0        Amy Dunn     21   0.952381        0.380952
1  Brannon Miller     21   0.761905        0.142857
2  Webster Butler     21   1.142857        0.190476
3  Michael Albert     23   0.913043        0.608696
4    Elijiah Gray     23   1.217391        0.260870
5   David Stanley     20   1.250000        0.400000
6  Elisa Bramante     14   0.000000        0.000000
7   Kelley Spirea     22   0.681818        0.272727
8  Kissy Sullivan     22   0.904762        0.285714
9   Ketsia Liebig     21   0.952381        0.523810

Средняя частота ошибок и количество жалоб на сотрудника напрямую зависят от того, под чьим руководством работает сотрудник.

### Зависимость предметов исследования от возраста сотрудника.

In [ ]:
sql = '''select case when "age" < 30 then '20_30'
when "age" < 40 then '30_40'
when "age" < 50 then '40_50'
when "age" >= 50 then '50+'
end as age_bin, count(1), avg("Daily Error Rate") as avg_error,
avg("90-day Complaints") as avg_complaints
 from
production_staff as ps
join hr_dataset on ps."Employee Name" = hr_dataset."Employee Name"
group by (case when "age" < 30 then '20_30'
when "age" < 40 then '30_40'
when "age" < 50 then '40_50'
when "age" >= 50 then '50+'
end)

'''
select(sql)

  age_bin  count  avg_error  avg_complaints
0   40_50     64   0.750000        0.234375
1   20_30     18   0.888889        0.277778
2     50+     27   1.037037        0.444444
3   30_40     99   0.979592        0.346939

Дневная частота ошибок и количество жалоб на сотрудника зависят от возраста нелинейно.

##maritaldesc

In [ ]:
sql = '''select "maritaldesc", count(1), avg("Daily Error Rate") as avg_error,
avg("90-day Complaints") as avg_complaints
 from
production_staff as ps
join hr_dataset on ps."Employee Name" = hr_dataset."Employee Name"
group by "maritaldesc"

'''
select(sql)

  maritaldesc  count  avg_error  avg_complaints
0     Widowed      6   1.000000        0.000000
1     Married     80   0.962500        0.325000
2   Separated      9   0.777778        0.444444
3      Single     89   0.920455        0.352273
4    Divorced     24   0.708333        0.208333

Дневная частота ошибок и количество жалоб на сотрудника не зависят от его семейного положения.

#Анализ затрат на набор персонала

In [ ]:
sql = 'select * from recruiting_costs'
select(sql)

    id                       Employment Source  ...  December  Total
0    1                               Billboard  ...       500   6192
1    2                           Careerbuilder  ...       410   7790
2    3              Company Intranet - Partner  ...         0      0
3    4                      Diversity Job Fair  ...         0  10021
4    5                       Employee Referral  ...         0      0
5    6                               Glassdoor  ...         0      0
6    7                     Information Session  ...         0      0
7    8                         Internet Search  ...         0      0
8    9                                MBTA ads  ...      1300  10980
9   10                             Monster.com  ...       500   5760
10  11                      Newspager/Magazine  ...       870   8291
11  12                    On-campus Recruiting  ...         0   7500
12  13                 On-line Web application  ...         0      0
13  14                                   Other  ...       810   3995
14  15                           Pay Per Click  ...       110   1323
15  16                  Pay Per Click - Google  ...       176   3509
16  17                    Professional Society  ...       100   1200
17  18       Search Engine - Google Bing Yahoo  ...       378   5183
18  19  Social Networks - Facebook Twitter etc  ...       478   5573
19  20                         Vendor Referral  ...         0      0
20  21                      Website Banner Ads  ...       865   7143
21  22                           Word of Mouth  ...         0      0

[22 rows x 15 columns]

Таблица recruiting_costs содержит информацию о затратах на различные каналы поиска новых сотрудников, тут интересно проанализировать, насколько они полезны и результативны.

In [ ]:
sql = '''select "Employee Source", count(1) from hr_dataset
where "Employee Source" != 'Indeed'
group by "Employee Source"
order by "Employee Source"

 '''
select(sql)

                           Employee Source  count
0                                Billboard     16
1                            Careerbuilder      1
2               Company Intranet - Partner      1
3                       Diversity Job Fair     29
4                        Employee Referral     31
5                                Glassdoor     14
6                      Information Session      4
7                          Internet Search      6
8                                 MBTA ads     17
9                              Monster.com     24
10                      Newspager/Magazine     18
11                    On-campus Recruiting     12
12                 On-line Web application      1
13                                   Other      9
14                           Pay Per Click      1
15                  Pay Per Click - Google     21
16                    Professional Society     20
17       Search Engine - Google Bing Yahoo     25
18  Social Networks - Facebook Twitter etc     11
19                         Vendor Referral     15
20                      Website Banner Ads     13
21                           Word of Mouth     13

Различные каналы поиска сотрудников неодинаково эффективны, некоторые позволяют привлечь большое количество людей при сравнительно небольших затратах, в то время как другие показывают низкую эффективность вложения средств.

In [ ]:
sql = '''select rc."Employment Source", rc."Total", hr."count",
rc."Total"/count as avg_worker_price from recruiting_costs as rc
left join (select "Employee Source", count(1) from hr_dataset
where "Employee Source" != 'Indeed'
group by "Employee Source"
order by "Employee Source") as hr
on "Employment Source" = "Employee Source"
order by avg_worker_price
'''
select(sql)

                         Employment Source  Total  count  avg_worker_price
0                  On-line Web application      0      1                 0
1                            Word of Mouth      0     13                 0
2               Company Intranet - Partner      0      1                 0
3                        Employee Referral      0     31                 0
4                                Glassdoor      0     14                 0
5                      Information Session      0      4                 0
6                          Internet Search      0      6                 0
7                          Vendor Referral      0     15                 0
8                     Professional Society   1200     20                60
9                   Pay Per Click - Google   3509     21               167
10       Search Engine - Google Bing Yahoo   5183     25               207
11                             Monster.com   5760     24               240
12                      Diversity Job Fair  10021     29               345
13                               Billboard   6192     16               387
14                                   Other   3995      9               443
15                      Newspager/Magazine   8291     18               460
16  Social Networks - Facebook Twitter etc   5573     11               506
17                      Website Banner Ads   7143     13               549
18                    On-campus Recruiting   7500     12               625
19                                MBTA ads  10980     17               645
20                           Pay Per Click   1323      1              1323
21                           Careerbuilder   7790      1              7790

Более 80-ти работников компании привлечены вообще без затрат, сюда входят люди, нанятые по рекомендациям, реферальным программам, поиску в интернете на бесплатных сайтах.
А такие ресурсы как гезеты, журналы, рекрутинг в социальных сетях, баннеры на сайтах и поиск работников среди студентов имеют наибольшую среднюю стоимость привлечения одного работника.

### Анализ заработной платы.

In [ ]:
sql = 'select * from salary_grid'
select(sql)

    id                      Position  ...  Hourly Mid  Hourly Max
0    1      Administrative Assistant  ...       19.23       24.04
1    2  Sr. Administrative Assistant  ...       21.63       26.44
2    3                  Accountant I  ...       24.72       29.95
3    4                 Accountant II  ...       29.88       35.89
4    5                Sr. Accountant  ...       37.01       44.45
5    6              Network Engineer  ...       32.14       42.44
6    7          Sr. Network Engineer  ...       47.82       57.91
7    8        Database Administrator  ...       32.84       44.86
8    9                       Sr. DBA  ...       55.77       66.91
9   10       Production Technician I  ...       19.23       24.04
10  11      Production Technician II  ...       23.08       27.88
11  12    Lead Production Technician  ...       26.44       31.25

[12 rows x 8 columns]

Таблица salary_grid содержит информацию о зарплатах, можно проверить насколько коррелирует отклонение зарплаты от среднего с отклонением производительности труда от среднего.

Мы можем дополнительно проверить зависимость производительности работника и заработной платы для таких должностей как Production Technician I и Production Technician II, потому что это самые массовые должности в компании. Это производственный персонал организации, а значит оценка его производительности должна быть объективной, так как рабочие задачи достаточно линейны.

In [ ]:
sql = '''with t as
(select ps."Position", ps."Employee Name", ps."Performance Score", ps."Daily Error Rate", ps."90-day Complaints", hr_dataset."Pay Rate",
hr_dataset."perf_scoreid"
from production_staff as ps join hr_dataset on ps."Employee Name" = hr_dataset."Employee Name" where ps."Position" = 'Production Technician I'
or ps."Position" = 'Production Technician II'),

g as
(select "Position", "Hourly Min",	"Hourly Mid",	"Hourly Max" from salary_grid where salary_grid."Position" =
 'Production Technician I' or salary_grid."Position" = 'Production Technician II')

select t."perf_scoreid", t."Performance Score", avg(t."Pay Rate"/g."Hourly Mid") as delta from t join g on t."Position" = g."Position" where t."Performance Score" !=
'N/A- too early to review'
group by "perf_scoreid", "Performance Score"
order by "perf_scoreid"
'''
select(sql)

   perf_scoreid  Performance Score     delta
0             0       90-day meets  1.060451
1             1                PIP  1.051101
2             2  Needs Improvement  0.973572
3             3        Fully Meets  1.050642
4             4            Exceeds  1.020266
5             5        Exceptional  1.061615

Если предположение о том, что чем выше perf_scoreid, тем выше соответствующая ему оценка, то политика начисления заработной платы требует существенной доработки.

Показатель delta означает насколько заработная плата указанной категории превышает среднюю (которая равна единице). Мы видим, что работники, имеющие худшую производительность (90-day meets, PIP) имеют такой же уровень заработной платы что и те, кто полностью соответствует выдвигаемым требованиям (Fully Meets), а также тем, кто показывает исключительные результаты (Exceptional).

Кроме того, сотрудники, чья производительность превышает заявленные требования (Exceeds) получают меньшую заработную плату чем те, кто им (требованиям) просто соответствует (Fully Meets).

Справедливым является только начисление чуть сниженной заработной платы тем, чьи результаты требуют улучшений (Needs Improvement).

#Выводы

На основании проведённой аналитики можно предложить следующие рекомендации по стратегии набора персонала, а также по взаимодействию с уже имеющимися сотрудниками.
<br><br>Необходимо обратить внимание на средний срок работы сотрудников IT департамента - если он начнёт сокращаться - это может стать проблемой.

<br>Может быть полезно предпринять меры в отношении менеджеров, средняя оценка производительности работников которых не удовлетворяет требованиям компании. Т.к. данные показывают, что есть зависимость между производительностью сотрудника и того, под чьим руководством он работает. Эта зависимость становиться ещё более заметной, если мы рассматриваем среднее количество дней, которые сотрудники работают в компании. Причём мы видим, что зачастую, у одного и того же менеджера подчинённые имеют и низкую производительность и короткое время работы в компании. В случае производственного персонала это касается также средней частоты ошибок и количества жалоб.

<br>При приёме новых сотрудников можно учитывать, что есть зависимость между производительностью и временем работы в компании с одной стороны, и семейным положением сотрудника с другой.

<br>Рекомендуется скорректировать ставку заработной платы с оценкой производительности сотрудника, отдельно нужно обратить внимание на производственный персонал, где сотрудники, чья производительность превышает заявленные требования, получают меньшую заработную плату, чем те, кто данным требованиям только соответствует.


<br>Необходимо скорректировать политику затрат на набор персонала. Существует зависимость между производительностью сотрудника и источником его привлечения.
Такие ресурсы как газеты, журналы, баннеры на сайтах и социальные сети приводят в компанию довольно много новых сотрудников, чьи показатели производительности и времени работы в компании ниже нормы, кроме того, эти ресурсы имеют достаточно высокую цену привлечения одного сотрудника, поэтому от их использования следует отказаться.
<br>Примерно такие же результаты имеют сотрудники, которые пришли в компанию благодаря рекомендациям других работников (сарафанное радио), по реферальным программам или с сайта glassdoor. Единственной выгодной стороной этих ресурсов является то, что привлечение сотрудника не требует вложения средств, поэтому отказаться от их использования невозможно.
<br>Привлечение новых сотрудников из числа студентов достаточно дорогое, однако такие сотрудники показывают замечательные результаты, поэтому вложение средств в развитие данных каналов набора новых сотрудников выглядит оправдано.
<br>Лучшим ресурсов привлечения новых сотрудников выглядят профессиональные сообщества, такие специалисты работают качественно, долго, в то время как цена их привлечения не высока.